var hist = document.getElementById("history");
var what = document.getElementById("what");
var about = document.getElementById("our");
var histB = document.querySelector(".hist");

var title = document.getElementById("title");
var textB = document.querySelector(".textBlock");

var content = histB.innerHTML; 
hist.addEventListener("click", function(){
    title.style.display = "block";
    textB.style.display = "block";
    foto.style.display = "none";
    title.innerHTML = "Історія";
    textB.innerHTML = "Найбільша у світі організація з організації підводного плавання, PADI, була створена в 1966 році двома друзями в штаті Іллінойс над пляшкою Джонні Уокера. Це правда. Джон Кронін, торговець обладнанням для підводного плавання для США Діверс, та Ральф Еріксон, інструктор з тренувань та плавання, були стурбовані індустрією підводного плавання. Вони відчували, що сертифікаційні агентства, що існували на той час, були непрофесійними, не використовували новітні інструкції та зробили людям надмірно важкий вступ у даний вид спорту. Джон та Ральф знали, що люди повинні навчитися дихати під водою настільки професійно, щоб їхнє перебування під водою було безпечним при мінімальній затраті часу. У 1966 році Джон приніс пляшку Джонні Уолкера Black Label і 30 доларів США в квартиру Ральфа в штаті Іллінойс в Мортон-Гроув. Вони вирішили, що настав час розпочати організацію навчання підводного плавання. Джон наполягав на тому, щоб слово \"професійний\" було в назві компанії. Ральф хотів \"асоціації інструкторів з дайвінгу\". Після декількох раундів Скотча народився скорочений ПАДІ: Професійна Асоціація Дайв Інструкторів. Їх мета - дати можливість багатьом людям насолоджуватися підводним світом, пропонуючи відповідне навчальне навчання підводного плавання, щоб створити впевнених аквалангістів, які регулярно ниряють."
    hist.style.color = "red";
    what.style.color = "black";
    about.style.color = "black";
    
    histB.innerHTML = "Головна &rarr; Про нас" + " &rarr; Історія";
});
what.addEventListener("click", function(){
    title.style.display = "block";
    textB.style.display = "block";
    foto.style.display = "none";
    title.innerHTML = "Чому Divers";
    textB.innerHTML = "Освіта - це найбільш навчально тверда система в дайвінгу. Курси розроблені таким чином, щоб зробити навчання приємним та корисним. Під керівництвом вашого професійного інструктора ви отримуєте впевненість, опановуючи важливі концепції безпеки та навички. Інструктори пройшли підготовку і проходитимуть до найвищих стандартів пірнання, підтримуючи тверду, проактивну систему управління якістю. Вивчення на основі результатів - Ви розвиваєте свій власний темп, демонструєте оволодіння конкретними вимогами продуктивності, необхідними для того, щоб стати аквалангістом. Навчання проходитиме в надійливому і добре підтримуваному середовищі. Освітні матеріали. Кваліфіковані дизайнерські навчальні посібники використовують найсучасніші технології та навчальні теорії для створення матеріалів. Незалежні навчальні матеріали, доступні в різноманітних засобах масової інформації - онлайнові програми, додатки на планшетах, посібники, робочі зони, мультимедійні диски та інше - дозволяють вам навчатися таким чином, що підходить для вас. Навчальні матеріали підтримки дозволяють інструктору надалі пояснювати важливі поняття та перевіряти розуміння. Освітні стандарти. Програма навчання підпадає під суворі стандарти освіти, які контролюються з урахуванням світової узгодженості та якості. Divers приймає активний підхід до управління якістю та довільно проводить опитування, щоб підтвердити, що їхні курси відповідають високим стандартам, а також очікуванням водолазів. Жодна інша навчальна організація водолазів не працює, щоб зберегти цей рівень професійної надійності та цілісності.";
        
    hist.style.color = "black";
    what.style.color = "red";
    about.style.color = "black";
    
    histB.innerHTML = "Головна &rarr; Про нас" + " &rarr; Чому Divers";
});

var foto = document.querySelector(".fotoBlock");

about.addEventListener("click", function(){
    title.style.display = "none";
    textB.style.display = "none";
    foto.style.display = "block";
    
    
    hist.style.color = "black";
    what.style.color = "black";
    about.style.color = "red";
    
    histB.innerHTML = "Головна &rarr; Про нас" + " &rarr; Наша команда";
});